Demo/app/controllers/comments_controller.rb

  def index
    @comments = Post.find(params[:post_id]).comments
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @comment = Comment.new(params[:comment])
    if @comment.save && request.xhr?
---
INSERT INTO "comments" ("commentable_id", "commentable_type", "created_at", "text", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commentable_id", nil], ["commentable_type", nil], ["created_at", Mon, 08 Oct 2012 18:12:18 UTC +00:00], ["text", "test"], ["updated_at", Mon, 08 Oct 2012 18:12:18 UTC +00:00]]

  def show
    @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "20"]]

  def set_variables
    @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "20"]]