Demo/app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "test"], ["created_at", Mon, 08 Oct 2012 17:54:55 UTC +00:00], ["title", "test"], ["updated_at", Mon, 08 Oct 2012 17:54:55 UTC +00:00]]

  def set_variables
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]